apps/web/tests/load/artillery.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  plugins:
    ensure: {}
  ensure:
    maxErrorRate: 1
    max95thResponseTime: 500

scenarios:
  - name: "Visitor Flow"
    flow:
      - get:
          url: "/"
      - think: 5
      - get:
          url: "/api/feed"
          capture:
            - json: "$[0].id"
              as: "postId"
      - think: 3
      - get:
          url: "/api/posts/{{ postId }}"
          ifTrue: "postId"